import axios from 'axios';
export const locations = [
  // "ירושלים 40-44, בני ברק",
  // "רבי עקיבא 82-84,בני ברק",
  // "רבי עקיבא 105-107, בני ברק",
  // "חזון אי''ש/רבי עקיבא, בני ברק",
  "חזון אי''ש 50-52 בני ברק",
  "חזון אי''ש 94,רמת גן",
  "הכבאים 1, רמת גן ישראל",
  "נווה יהושוע 28-32, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
  "הררי 9-3, רמת גן",
]
export const AddMiles = (miles,id) => {
  axios.put("http://localhost:52726/api/driver?idDrive=" + id + "&mileage="+miles).then(x => {
    console.log(x.data);
    this.props.StatusFalse();
  });
}
